# if 조건 :
#   실행
# else :
#   나머지 경우 실행

#############################

# if 조건 :
#   실행
# else :
#   if 조건 :
#     실행
#   else :
#       실행

# depth 가 깊어지므로..

# if 조건:
#     실행
# elif 조건:
#     실행
# else:
#     나머지 실행

######################################

phone_call = 112

if phone_call == 112:
    print('112 입니다 무엇을 도와 드릴까요')
else:
    print('잘 못 거셨어요')


#####################################


user_list = ['주원', '중훈', '상하', '성우', '형제', '경연', '지환', '준태']

if '주원' in user_list:
    print('주원은 있어요')

if '현재' in user_list:
    print('현재는 있어요')
else:
    print('현재는 없어요ㅠ')
